{
  "html": "<div id=\"BUV\" class=\"uplift front\">\n<div id=\"course-front-body\" class=\"responsive-padding\" style=\"color: #2d3b45; background: none; padding-bottom: 0px; padding-top: 0px;\">\n<article id=\"course-lesson-intro-text\" style=\"font-size: 1.2em;\">\n<h3 class=\"heavy\" style=\"margin: 0; font-size: 2.7em;\">Academic Masterclass</h3>\n<p>We are delighted to extend a warm welcome to each one of you as you embark on an exciting journey of academic excellence and personal growth here at British University Vietnam, in collaboration with the University of London. Congratulations on choosing to begin your educational adventure with us!. The International Foundation Program is a vital stepping stone that will prepare you for success in your chosen undergraduate program. As you join our vibrant and diverse community, you are taking the first steps towards achieving your academic and career aspirations. At British University Vietnam, we pride ourselves on providing a world-class education, fostering a supportive and inclusive environment, and nurturing talent. Here, you will find a team of dedicated educators and staff who are committed to helping you excel academically, develop essential life skills, and make lasting connections with your fellow students.</p>\n<p><span style=\"color: #0e68b3;\"><em>*Please note: As IFP and UOL exams are generally paper based/hand written, please ensure you bring a pen with you to every class.</em></span></p>\n</article>\n<section class=\"grid-row\">\n<article class=\"col-lg-4 buv-responsive-video-100\" style=\"padding-left: 12px; margin-bottom: 20px; margin-top: 20px;\"><strong style=\"font-family: inherit; font-size: 1.5em;\">Learning Objectives:</strong></article>\n<article class=\"col-lg-8\" style=\"margin-top: 20px; padding-left: 12px;\">\n<p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Explore a rich curriculum that builds a strong foundation in your chosen field of study.</p>\n<p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Engage in hands-on learning experiences and practical projects.</p>\n<p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Connect with professors who are experts in their respective fields.</p>\n<p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Participate in extracurricular activities and clubs to enrich your university experience.</p>\n<p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Access top-notch facilities and resources to support your academic journey.</p>\n</article>\n</section>\n</div>\n</div>\n<div class=\"grid-row responsive-padding\" style=\"padding-bottom: 0px; padding-top: 0px; margin-bottom: -50px;\">\n<p>&nbsp;</p>\n</div>"
}