{
  "html": "<div id=\"BUV\" class=\"uplift front\">\n    <div id=\"course-front-body\" class=\"responsive-padding\" style=\"color: #2d3b45; background: none; padding-bottom: 0px; padding-top: 0px;\">\n        <article id=\"course-lesson-intro-text\" style=\"font-size: 1.2em;\">\n            <h3 class=\"heavy\" style=\"margin: 0; font-size: 2.7em;\">Business and Management</h3>\n            <p>Business Management is one of the core modules of the University of London International Foundation Programme (IFP). It introduces students to the essential concepts, theories, and practices that underpin how businesses operate in local, national, and global contexts. The module explores the role of managers in planning, decision-making, and strategy, while also considering the responsibilities businesses hold towards stakeholders, society, and the environment. The module also develops transferable skills in research, writing, and communication. Through a combination of lectures, tutorials, formative tests, and a mock examination, students will be supported in preparing for the final written examination. By engaging fully with the module, students will gain a deeper understanding of how businesses make decisions and how these decisions impact both performance and wider society.</p>\n        </article>\n        <section class=\"grid-row\">\n            <article class=\"col-lg-12\" style=\"margin-top: 20px; padding-left: 12px;\">\n                <h3><strong>Learning Objectives for this module:</strong></h3>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Identify basic business structures and their functions.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Identify risk and major changes in the external business environment and assess the impact of these on business.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Analyse and discuss how managements make their choices regarding strategies and the theoretical models that help these to be implemented succesfully.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Analyse and discuss ways by which businesses can pursue their aims and objectives with effective management of resources including marketing, human resource management, finance and IT.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Provide a business critique of contemporary events, review the options available and recommend actions.</p>\n            </article>\n        </section>\n    </div>\n</div>\n<div class=\"grid-row responsive-padding\" style=\"padding-bottom: 0px; padding-top: 0px; margin-bottom: -50px;\">\n    <h3 style=\"padding-left: 12px;\"><strong>Module Content:</strong></h3>\n</div>"
}