{
  "html": "<div id=\"BUV\" class=\"uplift front\">\n    <section id=\"course-front-body\" class=\"responsive-padding\" style=\"color: #2d3b45; background: none; padding-bottom: 0px; padding-top: 0px;\">\n        <article id=\"course-lesson-intro-text\" style=\"font-size: 1.2em;\">\n            <h3 class=\"heavy\" style=\"margin: 0; font-size: 2.7em;\">Final Year Project</h3>\n            <p>In this module you will prepare a project proposal at the end of Level 5 and complete the project itself in Level 6. This involves: identifying a topic of interest, conducting primary and secondary research, including a critical literature review, planning the residue of the work to be done in Level 6, modelling,creating and documenting an artefact that is relevant to your course of study and that is a solution tothe problem set out in your proposal, writing a report describing the technical aspects of the project’s model and artefact, the processes involved in the performance of the project, and critically reflecting on the project’s findings and outcomes, and making a presentation of the technical aspects of the project, including a demonstration of the artefact and a critical evaluation of the project outcomes</p>\n        </article>\n        <section class=\"grid-row\">\n            <article class=\"col-lg-12\" style=\"margin-top: 20px; padding-left: 12px;\">\n                <h3><strong>Learning Objectives for this module:</strong></h3>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Demonstrate an understanding of techniques required to design and develop practical artificial intelligence using high level languages. [Knowledge and Understanding]</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Define and refine functional programming constructs required to meet the challenges of the original game concept. [Problem solving]</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Reflect upon the effectiveness of individual and industry standard ai techniques in order to improve the capability of developed autonomous agents. [Reflection]</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Apply knowledge and understanding of artificial intelligence in order to produce functional autonomous agents within a game. [Application]</p>\n            </article>\n        </section>\n    </section>\n</div>\n<div class=\"grid-row responsive-padding\" style=\"padding-bottom: 0px; padding-top: 0px; margin-bottom: -50px;\">\n    <h3 style=\"padding-left: 12px;\"><strong>Module Content:</strong></h3>\n</div>"
}