{
  "html": "<div id=\"BUV\" class=\"uplift front\">\n    <section id=\"course-front-body\" class=\"responsive-padding\" style=\"color: #2d3b45; background: none; padding-bottom: 0px; padding-top: 0px;\">\n        <article id=\"course-lesson-intro-text\" style=\"font-size: 1.2em;\">\n            <h3 class=\"heavy\" style=\"margin: 0; font-size: 2.7em;\">Introduction to Computing Science</h3>\n            <p>This module is intended for students who wish to acquire skills in computer programming and an understanding of the principles underlying computer systems and networks. It is compulsory for students entering degree programmes involving Computing Science, Software Engineering, Information Systems or Business Computing, but is available to all students. The goal of the module is to give you confidence in computational thinking and problem solving via programming. Lectures cover the basic principles of computer architecture, operating systems, and networks, and build an understanding of the multiple layers and levels of abstraction that allow computer systems to work. Computational thinking and computer programming are taught through a combination of lectures and extensive practical problem- solving exercises using the Java programming language. You'll also gain a broader view of the role of computer systems in society through group discussions on social, ethical, legal and professional issues arising in Computing.</p>\n        </article>\n        <section class=\"grid-row\">\n            <article class=\"col-lg-4\">\n                <p class=\"buv-responsive-video-100\"><iframe class=\"border-round\" style=\"display: inline-block; border: none;\" src=\"https://buv.instructuremedia.com/embed/9446e60b-2771-4638-a36a-583f1dac6276\" loading=\"lazy\" allowfullscreen=\"allowfullscreen\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" data-mce-fragment=\"1\"></iframe></p>\n            </article>\n            <article class=\"col-lg-8\" style=\"margin-top: 20px; padding-left: 12px;\">\n                <h3><strong>Learning Objectives for this module:</strong></h3>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Demonstrate an understanding of computer structure and functioning.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Critically discuss the relevance of computers and computing in society.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Apply theory and techniques to unseen problems, while workin independently, under time constraints, without reference to notes, and demonstrating a knowledge of expected professional and academic conduct.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Demonstrate an understanding of fundamental imperative programming constructs and their use by creating simple algorithms in a high-level programming language.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Use abstract, language-independent computational thinking to solve problems in a structured and analytical manner.</p>\n            </article>\n        </section>\n    </section>\n</div>\n<div class=\"grid-row responsive-padding\" style=\"padding-bottom: 0px; padding-top: 0px; margin-bottom: -50px;\">\n    <h3 style=\"padding-left: 12px;\"><strong>Module Content:</strong></h3>\n</div>"
}