{
  "html": "<div id=\"BUV\" class=\"uplift front\">\n<section id=\"course-front-body\" class=\"responsive-padding\" style=\"color: #2d3b45; background: none; padding-bottom: 0px; padding-top: 0px;\">\n<article id=\"course-lesson-intro-text\" style=\"font-size: 1.2em;\">\n<h3 class=\"heavy\" style=\"margin: 0; font-size: 2.7em;\">Design Practice and Strategy: (A) Applied Strategic Communication</h3>\n<p>This module offers essential insights into the communications workplace and enables students to navigate the sector effectively and consider their own potential positions within it. The syllabus aims and learning outcomes of this module A prepare the student with a foundation and skillset on which to build and progress into the module B in year 3 semester 2. Students will enjoy regular participation in industry-set briefs and competition briefs that will help refine their skills across creative communication and strategy, whilst increasing their industry awareness. To support this the module features guest communications industry speakers, from whom students will gain real-world insights into communications design agencies, providing invaluable experience into creative sector business operations.</p>\n</article>\n<div class=\"grid-row\">\n<article class=\"col-lg-12\" style=\"margin-top: 20px; padding-left: 12px;\">\n<h3><strong>Learning Objectives for this module:</strong></h3>\n<p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Respond effectively to industry-related briefs, showcasing capability to handle live design challenges.</p>\n<p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Develop a unique personal brand and compile a professional portfolio.</p>\n<p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Evidence networking and entrepreneurial skills through a final business proposition.</p>\n<p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Manage own project and time effectively as an independent learner.</p>\n</article>\n</div>\n</section>\n</div>\n<div class=\"grid-row responsive-padding\" style=\"padding-bottom: 0px; padding-top: 0px; margin-bottom: -50px;\">\n<h3 style=\"padding-left: 12px;\"><strong>Module Content:</strong></h3>\n</div>"
}