{
  "html": "<div id=\"BUV\" class=\"uplift front\">\n    <section id=\"course-front-body\" class=\"responsive-padding\" style=\"color: #2d3b45; background: none; padding-bottom: 0px; padding-top: 0px;\">\n        <article id=\"course-lesson-intro-text\" style=\"font-size: 1.2em;\">\n            <h3 class=\"heavy\" style=\"margin: 0; font-size: 2.7em;\">Applied Media Aesthetics: Introduction to Cinematography, Audio-Capture, and Editing</h3>\n            <p>This module explores the fundamental principles of media aesthetics through a combination of theoretical analysis and hands-on production. Students will examine how visual and auditory elements - such as light, colour, space, motion, and sound - shape meaning and perception through their capture and composition in film and media.The growing influence of artificial intelligence (AI) in creative media production will be explored and students will critically assess how AI tools in cinematography, sound design, editing, and visual effects are reshaping media aesthetics.</p>\n        </article>\n        <div class=\"grid-row\">\n            <article class=\"col-lg-12\" style=\"margin-top: 20px; padding-left: 12px;\">\n                <h3><strong>Learning Objectives for this module:</strong></h3>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Demonstrate the ability to analyse and apply media aesthetics principles to practical media production projects and Critically reflect on how AI and algorithmic tools are influencing aesthetics.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Demonstrate technical proficiency in fundamental media production techniques.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Exhibit problem-solving and collaboration and critical thinking skills in the media production practice.</p>\n               <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Be able to reflect on, and evaluate their own work and provide constructive feedback on peers’ projects </p>\n            </article>\n        </div>\n    </section>\n</div>\n<div class=\"grid-row responsive-padding\" style=\"padding-bottom: 0px; padding-top: 0px; margin-bottom: -50px;\">\n    <h3 style=\"padding-left: 12px;\"><strong>Module Content:</strong></h3>\n</div>"
}