{
  "html": "<div id=\"BUV\" class=\"uplift front\">\n    <section id=\"course-front-body\" class=\"responsive-padding\" style=\"color: #2d3b45; background: none; padding-bottom: 0px; padding-top: 0px;\">\n        <article id=\"course-lesson-intro-text\" style=\"font-size: 1.2em;\">\n            <h3 class=\"heavy\" style=\"margin: 0; font-size: 2.7em;\">Film and Media Production in Context: Narratives, Business and Legal Issues</h3>\n            <p>In this module, students will gain a contextualised introduction to the historical and contemporary development of the variety of narrative forms and genres that they will encounter through the programme. They will learn how to develop their own story telling and scriptwriting practice from word and still image to audio-visual moving image production. Students will understand the legalities and constraints of copyright and underlying rights in intellectual property development, acquisition and ownership. They will understand the script as both creative project design document and a business document within an industrial process requiring finance.\n</p>\n        </article>\n        <div class=\"grid-row\">\n            <article class=\"col-lg-12\" style=\"margin-top: 20px; padding-left: 12px;\">\n                <h3><strong>Learning Objectives for this module:</strong></h3>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Demonstrate the ability to research, conceptualise and write genre film production narratives (story proposals, treatments, step outlines, screenplay example).</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Research and articulate contextual factors (e.g. cultural, industrial, technological) that influence viability and choice of project, storytelling, scriptwriting, cast and locations.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Demonstrate ability to integrate business, financing and legal considerations into the development of film development packages.</p>\n            </article>\n        </div>\n    </section>\n</div>\n<div class=\"grid-row responsive-padding\" style=\"padding-bottom: 0px; padding-top: 0px; margin-bottom: -50px;\">\n    <h3 style=\"padding-left: 12px;\"><strong>Module Content:</strong></h3>\n</div>"
}