{
  "html": "<div id=\"BUV\" class=\"uplift front\">\n    <section id=\"course-front-body\" class=\"responsive-padding\" style=\"color: #2d3b45; background: none; padding-bottom: 0px; padding-top: 0px;\">\n        <article id=\"course-lesson-intro-text\" style=\"font-size: 1.2em;\">\n            <h3 class=\"heavy\" style=\"margin: 0; font-size: 2.7em;\">Cloud and Cyber</h3>\n            <p>Computing infrastructure and the data which is stored upon this is essential to businesses from the smallest through to global enterprises. In this module we will be looking at how corporations have adapted to this changing landscape with the increased reliance on the data which is stored. As data is becoming more important, we need to ensure that everything is stored in a manner which makes it accessible within the timeframe defined by the company and to ensure that it remains secure from people both outside and inside of a company. We will look at the transition which is taking place of moving corporate data and infrastructure to a Cloud based environment and ensuring that this meets the requirements of local legalisation and locally defined security requirements. This module will make use of the Amazon Web Services (AWS) Academic Learning environment to allow students to build confidence in Cloud computing and cyber security. Additionally, we will focus on the essential concepts of cyber security through understanding Cybersecurity principles applied to services, applications, servers, Cloud, and network devices, the module will also cover incident response management, Access control, basic concepts of network security, Backup, and recovery basics, how to identify vulnerabilities and put in place safeguards, Concepts of confidentiality, integrity, and availability.</p>\n        </article>\n        <div class=\"grid-row\">\n            <article class=\"col-lg-12\" style=\"margin-top: 20px; padding-left: 12px;\">\n                <h3><strong>Learning Objectives for this module:</strong></h3>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Demonstrate an understanding of cloud fundamentals. [Knowledge and understanding].</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Plan, design and implement a cloud-based solution considering security issues, proposing resolution advice, being able to identify, analyse and evaluate security threats and hazards. [Problem solving, communication]</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Demonstrate an understanding of fundamental concepts of cyber security. [Knowledge and understanding, learning, analysis, enquiry]</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Perform cybercrime investigation, using forensic tools for evidence. [Analysis, Enquiry, problem solving]</p>\n            </article>\n        </div>\n    </section>\n</div>\n<div class=\"grid-row responsive-padding\" style=\"padding-bottom: 0px; padding-top: 0px; margin-bottom: -50px;\">\n    <h3 style=\"padding-left: 12px;\"><strong>Module Content:</strong></h3>\n</div>"
}