{
  "html": "<div id=\"BUV\" class=\"uplift front\">\n    <section id=\"course-front-body\" class=\"responsive-padding\" style=\"color: #2d3b45; background: none; padding-bottom: 0px; padding-top: 0px;\">\n        <article id=\"course-lesson-intro-text\" style=\"font-size: 1.2em;\">\n            <h3 class=\"heavy\" style=\"margin: 0; font-size: 2.7em;\">Pre-visualisation, Cinematography, Production Design, Generative AI</h3>\n            <p>In this module, students will understand the interlinked practicalities of working from short scripts they have written to pre-visualisation, cinematography, production design and generative AI. From their screenwriting they will develop narrative storyboards – including hand-drawn, captured and AI generated images, to live action and programme generated animatics. They will use motion capture as a pre-visualisation tool with examples drawn from contemporary production practice.</p>\n        </article>\n        <div class=\"grid-row\">\n            <article class=\"col-lg-12\" style=\"margin-top: 20px; padding-left: 12px;\">\n                <h3><strong>Learning Objectives for this module:</strong></h3>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Demonstrate the ability to conceptualise and produce film and media using pre-visualisation, cinematographic planning, production design and generative AI.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Apply knowledge of cinematography and production design to plan and visualise scenes using appropriate tools, including generative AI and motion capture.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Demonstrate understanding of professional practices, including project management, data logging, and ethical considerations surrounding AI and creative authorship in film production.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Reflect critically on the creative and technical decisions made during the pre-visualisation and production design process through annotated portfolios and collaborative critique.</p>\n            </article>\n        </div>\n    </section>\n</div>\n<div class=\"grid-row responsive-padding\" style=\"padding-bottom: 0px; padding-top: 0px; margin-bottom: -50px;\">\n    <h3 style=\"padding-left: 12px;\"><strong>Module Content:</strong></h3>\n</div>"
}