{
  "html": "<div id=\"BUV\" class=\"uplift front\">\n    <section id=\"course-front-body\" class=\"responsive-padding\" style=\"color: #2d3b45; background: none; padding-bottom: 0px; padding-top: 0px;\">\n        <article id=\"course-lesson-intro-text\" style=\"font-size: 1.2em;\">\n            <h3 class=\"heavy\" style=\"margin: 0; font-size: 2.7em;\">Sound Design: Capture, Generative AI, Mixing</h3>\n            <p>This module introduces students to the fundamental principles and practices of sound recording and design for screen media. It combines theoretical insights with hands-on learning in both location-sound recording and post-production sound design using industry standard equipment and techniques. Emerging AI tools will be examined for their implications and applications in sound for screen media. The module also explores the crucial role of sound in storytelling and realisation of the screenplay for emotional impact, helping students understand how audio elements enhance narrative, mood, and audience engagement.</p>\n        </article>\n        <div class=\"grid-row\">\n            <article class=\"col-lg-12\" style=\"margin-top: 20px; padding-left: 12px;\">\n                <h3><strong>Learning Objectives for this module:</strong></h3>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Demonstrate technical proficiency in recording, editing, and mixing sound for screen media.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Apply creative sound design techniques to enhance storytelling and emotional engagement in media projects.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Demonstrate effective collaboration in small production teams, utilizing industry-standard workflows and best practices, including critical listening skills to reflect on and evaluate their own work and provide constructive feedback on peers’ projects.</p>\n            </article>\n        </div>\n    </section>\n</div>\n<div class=\"grid-row responsive-padding\" style=\"padding-bottom: 0px; padding-top: 0px; margin-bottom: -50px;\">\n    <h3 style=\"padding-left: 12px;\"><strong>Module Content:</strong></h3>\n</div>"
}