{
  "html": "<div id=\"BUV\" class=\"uplift front\">\n    <section id=\"course-front-body\" class=\"responsive-padding\" style=\"color: #2d3b45; background: none; padding-bottom: 0px; padding-top: 0px;\">\n        <article id=\"course-lesson-intro-text\" style=\"font-size: 1.2em;\">\n            <h3 class=\"heavy\" style=\"margin: 0; font-size: 2.7em;\">Risk Management for Sustainable Business</h3>\n            <p>Welcome to ‘Risk Management for Sustainable Business,’ a pivotal module designed for current and future leaders seeking to intertwine the principles of risk management with the imperatives of sustainable business practices. In today's rapidly evolving business landscape, the capacity to navigate risks while fostering sustainability is not just an advantage; it's a necessity. This module aims to equip students with the knowledge, skills, and insights needed to make informed decisions that balance economic, environmental, and social risks and opportunities</p>\n        </article>\n        <div class=\"grid-row\">\n            <article class=\"col-lg-12\" style=\"margin-top: 20px; padding-left: 12px;\">\n                <h3><strong>Learning Objectives for this module:</strong></h3>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Assess the nature, scope and impact of risk and uncertainty in the business context and show a keen appreciation for attitudes to risk and the consequences of loss in the modern world. (Knowledge and understanding, Learning, Enquiry)</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Demonstrate critical understanding of a) the meaning of risk: b) the different categories of risk; c) the role and purpose of risk management; d) the core elements of the risk management process; e) the attributes of communication and leadership within risk management. (Learning, Analysis)</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Develop and apply the relevant evaluation to assess enterprise risk management and operational risk management and take appropriate action in the face of risk and uncertainty towards sustainable businesses. (Application, Problem Solving)</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Reflect upon the role of risk &amp; uncertainty faced by management and leadership and appreciating the random nature of global events in the context of underpinning strategic agility and drive for results competencies and sustainable business. (Reflection)</p>\n            </article>\n        </div>\n    </section>\n</div>\n<div class=\"grid-row responsive-padding\" style=\"padding-bottom: 0px; padding-top: 0px; margin-bottom: -50px;\">\n    <h3 style=\"padding-left: 12px;\"><strong>Module Content:</strong></h3>\n</div>"
}