{
  "html": "<div id=\"BUV\" class=\"uplift front\">\n    <div id=\"course-front-body\" class=\"responsive-padding\" style=\"color: #2d3b45; background: none; padding-bottom: 0px; padding-top: 0px;\">\n        <article id=\"course-lesson-intro-text\" style=\"font-size: 1.2em;\">\n            <h3 class=\"heavy\" style=\"margin: 0; font-size: 2.7em;\">Cross-cultural Management and Leadership</h3>\n            <p>The module is designed to provide a comprehensive understanding of navigating cultural diversity and leading effectively in a globalized world.</p>\n            <p>This module explores the critical role of Human Resource Management (HRM) and management strategies in driving and enhancing organizational performance. It delves into the complexities of cross-cultural management and leadership, providing students with a comprehensive understanding of how cultural differences influence workplace dynamics and decision-making.</p>\n            <p>Through a combination of theoretical frameworks and practical applications, the module critically evaluates various strategies used to manage diverse teams, foster inclusive leadership, and align HRM practices with organizational goals. Students will engage with case studies, discussions, and real-world scenarios to develop the skills necessary for navigating the challenges of global and multicultural business environments.</p>\n        </article>\n        <div class=\"grid-row\">\n            <article class=\"col-lg-12\" style=\"margin-top: 20px; padding-left: 12px;\">\n                <h3><strong>Learning Objectives for this module:</strong></h3>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Understand ways in which changes to the external environment affect the organisation’s approach to strategic people management and organisational culture.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Critically evaluate the characteristics required for effective leadership at all levels in an organisation, within different cultural norms.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Evaluate current developments in talent management to enhance retention and organisational performance.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Understand how change, innovation and creativity can promote improvements in organisational performance and employee engagement.</p>\n                <p><span style=\"color: #ba372a; font-size: 14pt;\">+ &nbsp;</span>Promote the benefits of positive interrelationships between organisational commitment to ethics, sustainability, inclusion and wellbeing.</p>\n            </article>\n        </div>\n    </div>\n    <div class=\"grid-row responsive-padding\" style=\"padding-bottom: 0px; padding-top: 0px; margin-bottom: -50px;\">\n        <h3 style=\"padding-left: 12px;\"><strong>Module Content:</strong></h3>\n    </div>\n</div>"
}